export type sub={
  subject:string;
  detail:string;
}



export const one:sub[]=[
  {
    subject:'微分積分Ⅰ,Ⅱ',
    detail:'先生の問題がアホみたいにむずくて二回とも再試に引っかかった。だけど、ガチ勉強して単位は取った。推薦で入ったこともありかなり置いてかれたけど問題を解きすぎて積分が好きになってしまった。'
  },
  {
    subject:'線形代数Ⅰ,Ⅱ',
    detail:"行列について学んでいった。計算が苦手な自分は再試に引っかかったｗ最終的には単位が取れたので一安心。"
  },
  {
    subject:'物理学Ⅰ,Ⅱ',
    detail:"高校から物理は好きではなかったし授業内容も本当にあっているのか疑わしいものが多かった。"
  },
  {
    subject:"数学演習Ⅰ,Ⅱ",
    detail:"線形代数の演習をした。小テスト直前はガチ勉したものだｗ"
  },
  {
    subject:'計算機工学',
    detail:"計算機の歴史や仕組みについての勉強。評価はあまりよくなかった。テストでなんかやらかしたんかな？"
  },
  {
    subject:'情報工学概論',
    detail:"毎週違う先生の研究内容を聞くものだった。面白いものもあれば興味ないものもあった。最適化問題は面白かった記憶がある。"
  },
  {
    subject:'離散数学及び演習',
    detail:"論理と集合や証明がめちゃめちゃ多かった。演習は毎回友人と協力して解いた記憶しかないｗ"
  },
  {
    subject:'情報処理演習',
    detail:"Excel,Linax,Html,css,Latexを習った基本的に授業内で理解できる人は少ないと思う。独学で勉強する他できるようになる方法はないと思った。課題はきちんとこなしてたため問題なく単位は来た。"
  },
  {
    subject:'キャリアデザイン',
    detail:"キャリアについての話をされた。グループワークもあり割と楽しい授業だった。"
  },
  {
    subject:'プログラミング工学・演習',
    detail:"C言語について習った。後期にようやくプログラミングを習った。正直当時はついていけなかった。ポインタってなんやねん？配列ってなんやねん？って感じだった。春休みにガチ勉したら普通にその後プログラムを書くことがあっても苦戦することなく楽に書くことができた。"
  },
  {
    subject:'工学基礎実験',
    detail:"物理の原理を実際に実験してみようというものだった。レポートはまさかの手書き。コピペ防止とかなんだとかｗモンスターとチョコレートと共に死にそうになりながらレポートを書いたものだｗ"
  }
]

export const two:sub[]=[
  {
    subject:'応用数学A,B',
    detail:"前期は複素積分、後期は線形代数の基礎から応用までを習った。1年のときみたいになりたくなかったので授業動画を何回も見たりたくさん問題を解いたりした。評価は前後期Sだった。勉強してよかった！！！"
  },{
    subject:'技術者倫理',
    detail:"知的財産のことなどを学んだ。テストは難しかったが先生の話を聞いていたからかなんやかんや単位が来たｗ"
  },{
    subject:'確率統計Ⅰ,Ⅱ',
    detail:"1人で勉強してたら絶対挫折していた。友人の助けもあってテストは大丈夫だったがもう二度とやりたくないなと思った。"
  },{
    subject:'情報工学実験Ⅰ,Ⅱ',
    detail:"情報工学についての実験を行った。基本的にシミュレーション系統のものだと思ってほしい。プログラムを書いてその結果を考察するというものだった。個人的には楽しかったかなｗ"
  },
  
  
  
  /*
  'データ構造とアルゴリズム',
  '論理回路',
  '計算理論及び演習',
  'ネットワークデザイン',
  'オブジェクト指向開発',
  '情報理論',
  '数理計画法',
  */
  
]

export const three:sub[]=[
  {
    subject:'計算機アーキテクチャー',
    detail:"計算機のメモリの計算やアセンブリなど学んだ。正直難しかったが友人との勉強のおかげでテストは大丈夫だった。今内容を聞かれたら分からないものが多いので勉強しなおしておこうｗ"
  }
  
  
  /*
  'オペレーションシステム',
  '情報工学実験Ⅲ',
  '応用情報工学演習',
  '数値計算',
  'ディジタル通信工学',
  'モデリング理論',
  'オペレーションズリサーチ',
  'ソフトウェア工学',
  'メディアコンピューティング',
  'データベース',
  'ヒューマンインターフェイス',
  '情報セキュリティ',
  '教育システムデザイン',
  'データマイニング',
  '人工知能論',*/
]